Revit 2024 API
TableData.FreezeColumnsAndRows Property
 set to true if the columns and rows should be unmovable by the slider grips
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool FreezeColumnsAndRows { get; set; }
Visual Basic
Public Property FreezeColumnsAndRows As Boolean
	Get
	Set
Visual C++
public:
property bool FreezeColumnsAndRows {
	bool get ();
	void set (bool value);
}
See Also
TableData Class
Autodesk.Revit.DB Namespace